{"[pre]": 2, "create": 3, "string": 4, "s": 5, "[endl]": 6, "integers": 7, "x1,": 8, "y1,": 9, "x2,": 10, "y2": 11, "read": 12, "set": 13, "x1": 14, "to": 15, "s[0]": 16, "-": 17, "96": 18, "y1": 19, "s[1]": 20, "'0'": 21, "x2": 22, "print": 23, "maximum": 24, "of": 25, "absolute": 26, "value": 27, "and": 28, "y2,": 29, "newline": 30, "while": 31, "is": 32, "not": 33, "or": 34, "if": 35, "greater": 36, "than": 37, "\"r\"": 38, "increment": 39, "less": 40, "\"l\"": 41, "decrement": 42, "\"d\"": 43, "\"u\"": 44, "\"\\n\"": 45, "=": 46, "0": 47, "(x1": 48, "x2)": 49, "(y1": 50, "y2)": 51, "!=": 52, "true,": 53, "do": 54, "the": 55, "following": 56, ",": 57, "r": 58, "l": 59, "d": 60, "u": 61, "a": 62, "new": 63, "line": 64, "character": 65, "array": 66, "c1": 67, "size": 68, "2": 69, "c2": 70, "c1[0]": 71, "c1[1]": 72, "c2[0]": 73, "c2[1]": 74, "vector": 75, "ans": 76, "add": 77, "element": 78, "\"ru\"": 79, "end": 80, "else": 81, "\"rd\"": 82, "\"ld\"": 83, "\"lu\"": 84, "for": 85, "i": 86, "exclusive,": 87, "ans[i]": 88, "let": 89, "be": 90, "an": 91, "characters": 92, "length": 93, "strings": 94, "||": 95, "<": 96, "&&": 97, "push": 98, "into": 99, "increase": 100, "by": 101, "one": 102, "c1[1]>": 103, ">": 104, "decrease": 105, "all": 106, "elements": 107, "with": 108, "after": 109, "each": 110, "n,": 111, "m": 112, "long": 113, "x,": 114, "y,": 115, "a,": 116, "b": 117, "s,": 118, "s1": 119, "n": 120, "(s[0]": 121, "s1[0])": 122, "int(s[1]": 123, "s1[1])": 124, "-n": 125, "x": 126, "-m": 127, "y": 128, "bitwise": 129, "n,m": 130, "m,": 131, "s1[0],": 132, "s1[1]": 133, "invert": 134, "sign": 135, "'r'": 136, "'l'": 137, "'u'": 138, "'d'": 139, "max": 140, "(n)": 141, "(m)": 142, "now,": 143, "goal,": 144, "way": 145, "100": 146, "step,": 147, "i,": 148, "tstep": 149, "now": 150, "goal": 151, "now[0]": 152, "goal[0]": 153, "step": 154, "now[1]": 155, "goal[1]": 156, "exclusive": 157, "way[increment": 158, "step]": 159, "-step": 160, "tstep]": 161, "way[i]": 162, "strings.": 163, "equal": 164, "way[tstep]": 165, "'rd'": 166, "'ld'": 167, "'ru'": 168, "'lu'": 169, "49,": 170, "97": 171, "\"\"": 172, "integer": 173, "counter": 174, "true": 175, "sign_x": 176, "(x2": 177, "x1)": 178, "/": 179, "0,": 180, "sigh_y": 181, "sign_y": 182, "(y2": 183, "y1)": 184, "1": 185, "-1": 186, "sign_y,": 187, "break": 188, "loop": 189, "'\\n'": 190, "49": 191, "empty": 192, "int": 193, "abs(x2": 194, "otherwise": 195, "abs(y2": 196, "append": 197, "are": 198, "both": 199, "counter,": 200, "10": 201, "2d": 202, "csx": 203, "ctx": 204, "sx,": 205, "sy,": 206, "tx": 207, "ty": 208, "k": 209, "sy": 210, "sx": 211, "a[k]": 212, "6": 213, "8": 214, "3": 215, "5": 216, "k-th": 217, "4": 218, "7": 219, "inclusive": 220, "a[i]": 221, "csx,": 222, "tx,": 223, "1,": 224, "2,": 225, "3,": 226, "4,": 227, "5,": 228, "6,": 229, "7,": 230, "8,": 231, "declare": 232, "res": 233, "as": 234, "arguments": 235, "returning": 236, "return": 237, "from": 238, "function": 239, "-1,": 240, "xy": 241, "wtih": 242, "arguments,": 243, "j,": 244, "k,": 245, "l,": 246, "count,": 247, "count": 248, "to,": 249, "vec": 250, "from[0],": 251, "from[1],": 252, "to[0],": 253, "to[1]": 254, "result": 255, "run": 256, "vec,": 257, "vec[i]": 258, "that": 259, "returns": 260, "char": 261, "assign": 262, "called": 263, "to[0]": 264, "xy(x1,": 265, "xy(y1,": 266, "res(x,": 267, "y)": 268, "aa,": 269, "bb,": 270, "bb": 271, "aa": 272, "values": 273, "creat": 274, "t": 275, "abs(s[0]": 276, "t[0])": 277, "abs(s[1]": 278, "t[1])": 279, "t[0]": 280, "t[1]": 281, "t,": 282, "+": 283, "+1": 284, "define": 285, "'": 286, "symbol": 287, "',": 288, "short": 289, "'a'": 290, "b,": 291, "ints": 292, "abs(x": 293, "a)": 294, "abs(y": 295, "b)": 296, "d1": 297, "d2": 298, "abs(d1)": 299, "abs(d2)": 300, "min": 301, "c1,": 302, "abs(d1": 303, "d2)": 304, "minimum": 305, "d2,": 306, "casted": 307, "t[1],": 308, "(s[1]": 309, "s[i]": 310, "variable": 311, "inp": 312, "inp[0]": 313, "inp[1]": 314, "'0';": 315, "64": 316, "c": 317, "at": 318, "index": 319, "int;": 320, "ctr": 321, "dr": 322, "d[1]": 323, "dc": 324, "res[i]": 325, "vectors": 326, "vi,": 327, "vi2,": 328, "vi3,": 329, "vi4": 330, "f": 331, "abs(a)": 332, "abs(b)": 333, "f,": 334, "t[0],": 335, "c,": 336, "int(c)": 337, "int(d)": 338, "(a": 339, "\"ru\\n\"": 340, "\"rd\\n\"": 341, "\"lu\\n\"": 342, "\"ld\\n\"": 343, "\"u\\n\"": 344, "\"d\\n\"": 345, "\"r\\n\"": 346, "\"l\\n\"": 347, "arrays": 348, "ans,": 349, "xx": 350, "yy": 351, "abs(x)": 352, "abs(y)": 353, "xx,": 354, "y1-y2": 355, "abs(a": 356, "c)": 357, "abs(b": 358, "d)": 359, "start": 360, "endless": 361, "(b": 362, "d),": 363, "d,": 364, "s2": 365, "(s1[0]": 366, "s2[0])": 367, "(s1[1]": 368, "s2[1])": 369, "s1[0]": 370, "s2[0]": 371, "s2[1]": 372, "c_x": 373, "c_y": 374, "d_y": 375, "d_x": 376, ">=": 377, "-y": 378, "get": 379, "c_x,": 380, "d_y,": 381, "d_x,": 382, "open": 383, "file": 384, "\"cp.inp\"": 385, "reading": 386, "\"cp.out\"": 387, "writing": 388, "abs(s1[0]": 389, "abs(s1[1]": 390, "mode": 391, "using": 392, "stream": 393, "stdin": 394, "\"w\"": 395, "stdout": 396, "s1,": 397, "s2[1],": 398, "\"r\",": 399, "\"l\",": 400, "\"u\",": 401, "\"d\",": 402, "reference": 403, "in": 404, "t1": 405, "t2": 406, "t2,": 407, "abs(s1": 408, "t1)": 409, "abs(s2": 410, "t2)": 411, "x[0]": 412, "y[0]": 413, "x[1]": 414, "y[1]": 415, "q,": 416, "v,": 417, "z,": 418, "w,": 419, "u,": 420, "r,": 421, "q": 422, "q[0]": 423, "q[1]": 424, "w": 425, "g": 426, "inclusive,": 427, "\"g\"": 428, "minimal": 429, "sum": 430, "times": 431, "current": 432, "destination": 433, "input": 434, "udmoves": 435, "current[1]": 436, "destination[1]": 437, "rlmoves": 438, "current[0]": 439, "destination[0]": 440, "abs(udmoves)": 441, "abs(rlmoves)": 442, "current,": 443, "aboslute": 444, "rlmoves,": 445, "res,": 446, "o,": 447, "p": 448, "o": 449, "multiply": 450, "int(s)": 451, "int(a)": 452, "char(int(a)": 453, "1)": 454, "longs": 455, "*": 456, "(": 457, ")": 458, "n1,": 459, "n2": 460, "n1": 461, "n2,": 462, "s2)": 463, "abs(n1": 464, "n2)": 465, "startx,": 466, "starty,": 467, "endx,": 468, "endy": 469, "startx": 470, "starty": 471, "'1'": 472, "endx": 473, "v": 474, "starx": 475, "v[i]": 476, "variables": 477, "type": 478, "i-th": 479, "d=": 480, "k=": 481, "start,": 482, "dest": 483, "letter_start": 484, "letter_start=start[0]": 485, "letter_dest": 486, "dest[0]": 487, "num_start": 488, "start[1]": 489, "num_dest": 490, "dest[1]": 491, "num_dest,": 492, "v1,": 493, "v2,": 494, "v1": 495, "a[0]": 496, "b[0],": 497, "v2": 498, "a[1]": 499, "b[1]": 500, "v1+v2-minimum": 501, "b[0]": 502, "abs(a[0]": 503, "b[0])": 504, "abs(a[1]": 505, "b[1]);": 506, "i1,": 507, "i2,": 508, "l1": 509, "l2": 510, "abs(i1": 511, "l1)": 512, "abs(i2": 513, "l2)": 514, "i1": 515, "i2": 516, "l1,": 517, "l2,": 518, "s1[0]-'a'": 519, "s1[1]-'1'": 520, "s2[0]-'a'": 521, "s2[0]-'1'": 522, "str": 523, "1000": 524, "str[count]": 525, "str[i]": 526, "y1=": 527, "subtract": 528, "cx,": 529, "cy,": 530, "dx,": 531, "dy": 532, "cy": 533, "cx": 534, "48": 535, "dx": 536, "xd,yd": 537, "xd": 538, "yd": 539, "decrementing": 540, "can": 541, "abs(xd)": 542, "abs(yd)": 543, "mx": 544, "s1[0]-s2[0]": 545, "rx": 546, "ry": 547, "xf": 548, "yf": 549, "1;": 550, "kol": 551, "==": 552, "kol,": 553, "{1,": 554, "1}": 555, "{0,": 556, "-1}": 557, "ans[i],": 558, "xie,": 559, "int(b)": 560, "xie": 561, "abs(abs(dx)": 562, "abs(dy))": 563, "abs(dx)": 564, "abs(dy)": 565, "s1[1]-s2[1]": 566, "s1[1]+1": 567, "r1,": 568, "r2,": 569, "=integers": 570, "=string": 571, "r1": 572, "r2": 573, "absolute(r1": 574, "r2)": 575, "absolute(c1": 576, "c2)": 577, "(r1": 578, "abs(r1": 579, "abs(c1": 580, "strings,": 581, "1001": 582, "c[0]": 583, "c[1]": 584, "d[0]": 585, "cnt": 586, "s[cnt]": 587, "content": 588, "indices": 589, "through": 590, "xs,": 591, "ys,": 592, "xt,": 593, "yt": 594, "200": 595, "xs": 596, "ys": 597, "xt": 598, "l[n]": 599, "yt,": 600, "yet": 601, "yes": 602, "l[i]": 603, "p1": 604, "p2": 605, "chars": 606, "p2[0]": 607, "p1[0],": 608, "p2[1]": 609, "p1[1];": 610, "pointers": 611, "(lesser": 612, "x)": 613, "x--": 614, "y--": 615, "inline": 616, "no": 617, "ch": 618, "digit": 619, "'-',": 620, "bitshift": 621, "left": 622, "fx,": 623, "fy,": 624, "fx": 625, "fy": 626, "an[incremented": 627, "ans]": 628, "an[i]": 629, "whitespace": 630, "getchar()": 631, "'-'": 632, "(x": 633, "<<": 634, "3)": 635, "an[ans]": 636, "inccrement": 637, "gap": 638, "characters,": 639, "terminated": 640, "'\\n',": 641, "discard": 642, "start[0]": 643, "end[0]": 644, "end[1]": 645, "'r',": 646, "'l',": 647, "'d',": 648, "'u',": 649, "hi2": 650, "hi2,": 651, "abs(x1": 652, "abs(hi2": 653, "hi2>": 654, "b[1])": 655, "b[1],": 656, "then": 657, "ex": 658, "ey": 659, "flag1": 660, "flag2": 661, "fabs(ex": 662, "sx)": 663, "fabs(ey": 664, "sy)": 665, "flag1,": 666, "ex-sx": 667, "ey-sy": 668, "fabs": 669, "argument": 670, "s2,": 671, "t1,": 672, "abs(m)": 673, "abs(n)": 674, "on": 675, "every": 676, "iteration": 677, "diag": 678, "diag2": 679, "i1-l1": 680, "getint": 681, "'9'": 682, "b[0]-a[0],": 683, "excluisve,": 684, "absoluve": 685, "integet": 686, "b[0]-a[0]": 687, "b[1]-a[1]": 688, "truthy": 689, "'0',": 690, "max(fabs(x1": 691, "x2),": 692, "fabs(y1": 693, "y2))": 694, "ans--": 695, "more": 696, "reduce": 697, "lessen": 698, "fastio": 699, "invoke": 700, "mat": 701, "j": 702, "mat[i][j]": 703, "lc,": 704, "rc,": 705, "tr": 706, "br": 707, "lc": 708, "rc": 709, "boolean": 710, "first": 711, "false": 712, "'*'": 713, "false,": 714, "min_i,": 715, "min_j,": 716, "max_i,": 717, "max_j,": 718, "min_i": 719, "51,": 720, "min_j": 721, "51": 722, "55": 723, "a[i][j]": 724, "max_i": 725, "max_j": 726, "integers,": 727, "z": 728, "55,": 729, "check": 730, "mn,": 731, "mx,": 732, "mn": 733, "888888,": 734, "s[i][j]": 735, "check[i]": 736, "m1": 737, "m2": 738, "444": 739, "ar": 740, "uper,": 741, "lowar,": 742, "right": 743, "ck": 744, "con": 745, "ar[i][j]": 746, "uper": 747, "lowar": 748, "left,": 749, "'*''": 750, "\"*\"": 751, "vec[j": 752, "m]": 753, "h1": 754, "stop": 755, "h2": 756, "until": 757, "<=": 758, "vec[q": 759, "yy,": 760, "2e9,": 761, "2e9": 762, "'*',": 763, "66": 764, "6666,": 765, "c[i][j]": 766, "finishx,": 767, "finishy,": 768, "startx=55,": 769, "starty=55": 770, "st": 771, "st[i][j]": 772, "finishx": 773, "finishy": 774, "90": 775, "hangx": 776, "4409": 777, "coty": 778, "4999": 779, "tt": 780, "xaydung": 781, "hang,": 782, "cot": 783, "void": 784, "hang": 785, "bao1": 786, "bao2": 787, "demx": 788, "demy": 789, "maxx": 790, "f[x][col]": 791, "f[hang][y]": 792, "coty[0]": 793, "coty[tt-1]": 794, "f[i][cot]": 795, "hangx[0]": 796, "hangx[tt-1]": 797, "f[hang][i]": 798, "'.'": 799, "f[i][j]": 800, "hangx[tt]": 801, "coty[tt]": 802, "sort": 803, "chodoi": 804, "\".\"": 805, "f[x][cot]": 806, "coty[tt": 807, "1]": 808, "hangx[tt": 809, "call": 810, "xaydung(i,": 811, "j)": 812, "100,": 813, "-100,": 814, "-100": 815, "q[i][j]": 816, "xmin,": 817, "xmax,": 818, "ymin,": 819, "ymax,": 820, "xmin": 821, "200,": 822, "xmax": 823, "ymin": 824, "ymax": 825, "p,": 826, "e": 827, "counting": 828, "down": 829, "50,": 830, "50": 831, "substring": 832, "arr": 833, "arr[i][j]": 834, "up,": 835, "down,": 836, "up": 837, "mni,": 838, "mnj,": 839, "mxi": 840, "mxj": 841, "mni": 842, "int_max,": 843, "mnj": 844, "miny,": 845, "maxy,": 846, "minx,": 847, "maxx,": 848, "miny": 849, "maxy": 850, "minx": 851, "f[i][r]": 852, "ch,": 853, "ch1,": 854, "ch2,": 855, "ch3": 856, "ch4": 857, "ch1": 858, "1001,": 859, "ch2": 860, "x0": 861, "y0": 862, "0;": 863, "s[j]": 864, "d[2]": 865, "d[3]": 866, "d[0],": 867, "d[1],": 868, "d[2],": 869, "d[3],": 870, "go": 871, "jump": 872, "point": 873, "=n": 874, "label": 875, "lx": 876, "ly": 877, "constant": 878, "mod": 879, "1000000007": 880, "inf": 881, "inf2": 882, "1000000007ll": 883, "double": 884, "eps": 885, "1e-9": 886, "min,": 887, "minj": 888, "maxi,": 889, "maxj": 890, "-inf": 891, "mini": 892, "maxi": 893, "a1,": 894, "a2,": 895, "a3": 896, "a4": 897, "a1": 898, "a2": 899, "a3,": 900, "a4,": 901, "lett(n)": 902, "errl": 903, "lett[i]": 904, "err": 905, "lett[i][j]": 906, "\"": 907, "lett[j][i]": 908, "alt,": 909, "ust,": 910, "sag,": 911, "sol,": 912, "alt": 913, "-1000,": 914, "ust": 915, "1000,": 916, "sag": 917, "sol": 918, "incluisive,": 919, "60": 920, "mini,": 921, "500,": 922, "500": 923, "endj": 924, "ch[i][j]": 925, "incrementing": 926, "endi": 927, "99999999": 928, "101": 929, "lu,": 930, "ru,": 931, "ld,": 932, "rd,": 933, "lu": 934, "100000": 935, "ld": 936, "ru": 937, "rd": 938, "hi,": 939, "hj,": 940, "li,": 941, "lj": 942, "hi": 943, "hj": 944, "li": 945, "flag": 946, "lj,": 947, "gg": 948, "char,": 949, "0x3f,": 950, "0x3f": 951, "m3": 952, "m4": 953, "map": 954, "map[i][j]": 955, "map[j][i]": 956, "booleans": 957, "52": 958, "g,": 959, "999999": 960, "ok": 961, "999,": 962, "999": 963, "mini1,": 964, "mini2,": 965, "maxi1,": 966, "maxi2,": 967, "mini1": 968, "60,": 969, "mini2": 970, "maxi1": 971, "maxi2": 972, "imx,": 973, "imn,": 974, "jmx": 975, "jmn": 976, "imn": 977, "1222": 978, "imx": 979, "s[k][p]": 980, "-2019,": 981, "-2019": 982, "a[j][i]": 983, "1e4,": 984, "1e4": 985, "continue": 986, "!s": 987, "e,": 988, "arr1": 989, "arr1[k][l]": 990, "arr1[i][j]": 991, "imin,": 992, "imax,": 993, "jmin": 994, "jmax": 995, "imin": 996, "imex": 997, "str[i][j]": 998, "imax": 999, "jmin,": 1000, "jmax,": 1001, "max,": 1002, "row_min,": 1003, "row_max": 1004, "row_min": 1005, "row_max,": 1006, "right,": 1007, "c[2]": 1008, "c[3]": 1009, "9": 1010, "11": 1011, "fill": 1012, "s[(i": 1013, "%": 1014, "r[(i": 1015, "r[i]": 1016, "a[(i": 1017, "j]": 1018, "i=": 1019, "arr[j][i]": 1020, "34298343": 1021, "2193809": 1022, "data": 1023, "initialized": 1024, "data[i]": 1025, "data[i][j]": 1026, "m1,": 1027, "craete": 1028, "row": 1029, "col": 1030, "graph": 1031, "start_x": 1032, "start_y": 1033, "end_x": 1034, "end_y": 1035, "graph[i][j]": 1036, "row,": 1037, "min_x": 1038, "min_y": 1039, "max_x": 1040, "max_y,": 1041, "max_y": 1042, "ch[i]": 1043, "q[i]": 1044, "**sheet": 1045, "*[n]": 1046, "minrow": 1047, "mincol": 1048, "maxrow": 1049, "maxcol": 1050, "sheet[i][j]": 1051, "minrow,": 1052, "maxrow,": 1053, "mincol,": 1054, "maxcol,": 1055, "pointer": 1056, "sheet": 1057, "sheet[i]": 1058, "**shap": 1059, "shap[i]": 1060, "newchar[m]": 1061, "rows,": 1062, "colums,": 1063, "rowe": 1064, "colume": 1065, "user": 1066, "shap[i][j]": 1067, "loop,": 1068, "change": 1069, "rows": 1070, "name": 1071, "colums": 1072, "standard": 1073, "output": 1074, "123": 1075, "1e9": 1076, "kiot_camp,": 1077, "x3,": 1078, "y3,": 1079, "x4,": 1080, "y4": 1081, "exit": 1082, "kiot_camp": 1083, "y3": 1084, "x3": 1085, "x4": 1086, "n,m=int": 1087, "s=vector": 1088, "checktop": 1089, "(no": 1090, "args,": 1091, "int)": 1092, "i=0": 1093, "j=0": 1094, "checkbottom": 1095, "i=n-1": 1096, "checkleft": 1097, "checkright": 1098, "i=m-1": 1099, "resize": 1100, "left=checkleft()": 1101, "right=checkright()": 1102, "top=checktop()": 1103, "bottom=checkbottom()": 1104, "i=top": 1105, "bottom": 1106, "starting": 1107, "len": 1108, "right-left+1": 1109, "n-1": 1110, "m-1": 1111, "flag=0": 1112, "i=u": 1113, "j=l": 1114, "'#'": 1115, "inclusive;": 1116, "modulo": 1117, "\"#\"": 1118, "odd": 1119, "where": 1120, "a1[i]": 1121, "a2[i]": 1122, "a3[i]": 1123, "a1[m]": 1124, "'\\0'": 1125, "a2[m]": 1126, "a3[m]": 1127, "a2[m": 1128, "a3[0]": 1129, "bitwise-and": 1130, "(i": 1131, "multiple": 1132, "even": 1133, "\"#\\n\"": 1134, "\".\\n\"": 1135, "const": 1136, "maxn": 1137, "200000": 1138, "zw": 1139, "make": 1140, "pair": 1141, "30": 1142, "ss,": 1143, "sss": 1144, "&": 1145, "falsy,": 1146, "!f": 1147, "2)": 1148, "temp": 1149, "uneven": 1150, "=1": 1151, ".": 1152, "adding": 1153, "even[i]": 1154, "further": 1155, "#": 1156, "1e5": 1157, "nn": 1158, "305": 1159, "print('#',": 1160, "m)": 1161, "print('.',": 1162, "method": 1163, "different": 1164, "flg": 1165, "=0,": 1166, "odd,": 1167, "even,": 1168, "lie": 1169, "skip": 1170, "rest": 1171, "filled": 1172, "changing": 1173, "increasing": 1174, "setting": 1175, "a[i][0]": 1176, "a[i][m": 1177, "printing": 1178, "cnt,": 1179, "sum,": 1180, "rem,": 1181, "rem": 1182, "v3": 1183, "make_pair": 1184, "long,": 1185, "se": 1186, "h,": 1187, "pritn": 1188, "isn't": 1189, "reset": 1190, "i=1": 1191, "m=": 1192, "a[51][51]": 1193, "i=i+2": 1194, "exclusivem": 1195, "i+1": 1196, "a[i][j]=.": 1197, "exclusive;": 1198, "endline": 1199, "value)": 1200, "fastio()": 1201, "n,m=long": 1202, "(i+1)": 1203, "h": 1204, "120": 1205, "0)": 1206, "2000010": 1207, "taking": 1208, "mul": 1209, "1ll": 1210, "?": 1211, ":": 1212, "10000": 1213, "((i": 1214, "'#')": 1215, ">>": 1216, "isitright": 1217, "j=1": 1218, "s=0": 1219, "a-1": 1220, "v=0": 1221, "b-1": 1222, "n/2,": 1223, "=1,": 1224, "l=0": 1225, "k=1": 1226, "k=2": 1227, "1.exclusive,": 1228, "bool": 1229, "col-1": 1230, "=0": 1231, "j=m": 1232, "20": 1233, "[100][100]": 1234, "a[i][1]": 1235, "but": 1236, "last": 1237, "equals": 1238, "power": 1239, "(get": 1240, "a,b,modi,": 1241, "res=1": 1242, "res=(res*a)": 1243, "modi": 1244, "divide": 1245, "a=(a*a)": 1246, "dirx=array": 1247, "int,": 1248, "-1,-1,-1,0,0,1,1,1": 1249, "diry=array": 1250, "-1,0,1,-1,1,-1,0,1": 1251, "dx=array": 1252, "-1,1,0,0": 1253, "dy=array": 1254, "0,0,-1,1": 1255, "k,x,y=int,": 1256, "sum,ans,cur=0": 1257, "n,m,r,c=int": 1258, "a=array": 1259, "1005": 1260, "s,t,r=string": 1261, "c=0": 1262, "decremented": 1263, "(c": 1264, "column": 1265, "s3": 1266, "columns": 1267, "**p": 1268, "*[n": 1269, "assigning": 1270, "int[m": 1271, "p[i]": 1272, "tests": 1273, "a[n][m]": 1274, "j=m-1": 1275, "a[n][m]=#": 1276, "integer.": 1277, "ma": 1278, "\"#\",": 1279, "iterate": 1280, "check,": 1281, "lol": 1282, "flag=1": 1283, "\".\",": 1284, "rtr": 1285, "c[j]": 1286, "c[m]": 1287, "4=0": 1288, "num": 1289, "o=true": 1290, "o=false": 1291, "a[i][m-1]": 1292, "n,m,i,j=int": 1293, "part": 1294, "c=1": 1295, "flag=false": 1296, "flag=true": 1297, "mxn": 1298, "[101][101]": 1299, "(j": 1300, "m),": 1301, "(cnt": 1302, "1),": 1303, "sizeof(a)": 1304, "bytes": 1305, "i/2": 1306, "event": 1307, "c[i][m": 1308, "4;": 1309, "c[i][0]": 1310, "a[i][m]": 1311, "a[55]": 1312, "m-1,": 1313, "j=m-1,": 1314, "j=0,": 1315, "check=1": 1316, "check=0": 1317, "statement": 1318, "mk": 1319, "mx[x][y]": 1320, "mk[x": 1321, "1][y]": 1322, "mk[i][j]": 1323, "falsy": 1324, "which": 1325, "takes": 1326, "i*i": 1327, "evenly": 1328, "divisible": 1329, "1000005": 1330, "c(i)": 1331, "g[l": 1332, "i]": 1333, "c(i),": 1334, "g[i]": 1335, "intergers": 1336, "g[i],": 1337, "argument,": 1338, "g[l+1+i]": 1339, "\"yes\\n\"": 1340, "\"no\\n\"": 1341, "sz": 1342, "1003": 1343, "isprime": 1344, "sieve": 1345, "isprime,": 1346, "isprime[1]": 1347, "isprime[0]": 1348, "isprime[i]": 1349, "iprime[j]": 1350, "primes": 1351, "primes[i]": 1352, "primes[i": 1353, "isprime[num]": 1354, "ji": 1355, "prime": 1356, "p[ji]": 1357, "isprime[j]": 1358, "isprime[j+1]": 1359, "p[i+1]": 1360, "isprime[j": 1361, "p[i": 1362, "ifprime": 1363, "squared": 1364, "divides": 1365, "without": 1366, "remainder": 1367, "good": 1368, "3000": 1369, "ifprime(i)": 1370, "good[i": 1371, "good[i]": 1372, "\"yes\"": 1373, "\"no\"": 1374, "good[i+last+1]": 1375, "1005,": 1376, "prime[1]": 1377, "falst": 1378, "sq": 1379, "ceil": 1380, "square": 1381, "root": 1382, "1005+0.0": 1383, "prime[j]": 1384, "prime[i]": 1385, "prime[i": 1386, "prn": 1387, "pr[i]": 1388, "j*j": 1389, "next": 1390, "pr[j]": 1391, "pr[k]": 1392, "next[j]": 1393, "pr[i": 1394, "k]": 1395, "next[x]": 1396, "primos": 1397, "esprimo": 1398, "primo": 1399, "esprimo[i]": 1400, "primos[i": 1401, "primos[i]": 1402, "esprimo[primos[i": 1403, "1],": 1404, "n+1,": 1405, "primos[i+1]": 1406, "1111": 1407, "plen": 1408, "p[increment": 1409, "plen]": 1410, "a[j]": 1411, "p[j]": 1412, "p[j+1]": 1413, "p[plen]": 1414, "incresing": 1415, "p[j": 1416, "num[0]": 1417, "num[1]": 1418, "num[i]": 1419, "num[j]": 1420, "2]": 1421, "num[sum]": 1422, "can[i]": 1423, "can[last+i+1]": 1424, "can[last": 1425, "m[primes[i]": 1426, "primes[i-1]": 1427, "bitset": 1428, "was": 1429, "100010": 1430, "bits": 1431, "was[0]": 1432, "was[1]": 1433, "was[i]": 1434, "m[i]": 1435, "was[j]": 1436, "bit": 1437, "sieve(n)": 1438, "sqrt(a)": 1439, "fase": 1440, "a^2": 1441, "divided": 1442, "defined,": 1443, "1010": 1444, "visit": 1445, "visit[i]": 1446, "p[++*p]": 1447, "visit[j]": 1448, "*p": 1449, "(t": 1450, "visit[t]": 1451, "\"yes\",": 1452, "pd": 1453, "find_prime": 1454, "pd[0]": 1455, "pd[1]": 1456, "pd[i]": 1457, "[num]": 1458, "pd[i": 1459, "prime[j]]": 1460, "find": 1461, "mid": 1462, "(l": 1463, "r)": 1464, "prime[mid]": 1465, "mz": 1466, "pos": 1467, "pd[t]": 1468, "find(t)": 1469, "prime[pos": 1470, "prime[pos]": 1471, "prime[maxn],": 1472, "prime[incremented": 1473, "num]": 1474, "maxn,": 1475, "pd[i*prime[j]]": 1476, "pos,": 1477, "flag,": 1478, "(square": 1479, "tmp,": 1480, "tmp": 1481, "ju": 1482, "insert": 1483, "iterator": 1484, "it": 1485, "beginning": 1486, "ju,": 1487, "{1,1}": 1488, "2002": 1489, "{0}": 1490, "b[p[i]": 1491, "b[i]": 1492, "a[i],": 1493, "puts": 1494, "isp": 1495, "isprime(i)": 1496, "can(s)": 1497, "primes[0]": 1498, "primes[1]": 1499, "v[j]": 1500, "v[j": 1501, "20000": 1502, "[n": 1503, "5]": 1504, "fin": 1505, "30000": 1506, "seive": 1507, "f[0]": 1508, "f[1]": 1509, "f[i]": 1510, "exists": 1511, "f[j]": 1512, "previ": 1513, "2000": 1514, "defined": 1515, "prime[c]": 1516, "memset": 1517, "fin,": 1518, "test": 1519, "fin[test]": 1520, "fin[i]": 1521, "fin[i-1]": 1522, "fin[num]": 1523, "previ,": 1524, "prime[0]": 1525, "c]": 1526, "f[test],": 1527, "num,": 1528, "output.txt": 1529, "input.txt": 1530, "fast": 1531, "pi": 1532, "3.1415926": 1533, "1e3": 1534, "solve": 1535, "arr[x]": 1536, "arr[j]": 1537, "arr[j": 1538, "address": 1539, "is_prime": 1540, "mark": 1541, "mark[i]": 1542, "mark[j]": 1543, "sqrt(n)": 1544, "nextprime": 1545, "isprime(ans)": 1546, "noldbach": 1547, "nextprimenum": 1548, "nextprime(i)": 1549, "noldbach(i)": 1550, "error": 1551, "otherwise,": 1552, "arrar": 1553, "check(i)": 1554, "(good[i]": 1555, "true)": 1556, "pri": 1557, "168": 1558, "a[temp]": 1559, "a[j": 1560, "increments": 1561, "pri(i)": 1562, "1000+10,": 1563, "1000+10": 1564, "num[i],": 1565, "prime[increment": 1566, "prime[j": 1567, "*i": 1568, "cin": 1569, "!num[i]": 1570, "4000": 1571, "4000,": 1572, "binary_search": 1573, "prime,": 1574, "p[0]": 1575, "p[1]": 1576, "1009": 1577, "ok[i": 1578, "incremement": 1579, "prime[i-1]+prime[i-2]+1": 1580, "num[sum],": 1581, "zero": 1582, "!num[sum]": 1583, "sievesize": 1584, "bs": 1585, "bs[0]": 1586, "bs[1]": 1587, "bs[i]": 1588, "bs[j]": 1589, "primes[j]": 1590, "primes[j+1]": 1591, "primes[i],": 1592, "600,": 1593, "putprime": 1594, "600": 1595, "primes[increment": 1596, "point]": 1597, "isnoldprime": 1598, "primes[i]*2": 1599, "primes[i+1]": 1600, "primes[point]": 1601, "isprime(x)": 1602, "returned": 1603, "peimrs[i]": 1604, "<=x": 1605, "isnoldprime(i)": 1606, "judge": 1607, "a[u]": 1608, "ii": 1609, "a[s]": 1610, "ii,": 1611, "a[r": 1612, "a[r]": 1613, "sqrt": 1614, "tp": 1615, "cm": 1616, "lt": 1617, "tp(let": 1618, "integer)": 1619, "has": 1620, "cm(let": 1621, "tp(i)": 1622, "assigned": 1623, "cm(p)": 1624, "yes,": 1625, "character,": 1626, "flush": 1627, "condition": 1628, "met": 1629, "so": 1630, "no,": 1631, "0}": 1632, "2002,": 1633, "pp,": 1634, "1111,": 1635, "pp": 1636, "2222,": 1637, "2222": 1638, "pm": 1639, "modulus": 1640, "pm2": 1641, "prime[i],": 1642, "prime[j],": 1643, "prime[i+j+1],": 1644, "pp[i+j+1]": 1645, "cnt[i]": 1646, "cnt[i-1]": 1647, "pp[i]": 1648, "cnt[n]": 1649, "newline\"": 1650, "pv": 1651, "pv[i]": 1652, "pv[i": 1653, "ok(i": 1654, "oolean": 1655, "pv[i+1]": 1656, "lt,": 1657, "ok[i]": 1658, "ok[lt": 1659, "ok[lt+i+1]": 1660, "os": 1661, "prime[num]": 1662, "find_prime()": 1663, "mz(prime[i])": 1664, "100001": 1665, "check(s)": 1666, "1000010": 1667, "phi": 1668, "primesize": 1669, "register": 1670, "isdigit": 1671, "isprime[r]": 1672, "getlist": 1673, "listsize,": 1674, "listsize": 1675, "primesize]": 1676, "isprime[i*prime[j]]": 1677, "read,": 1678, "pre": 1679, "init": 1680, "prime[cnt]": 1681, "check(t),": 1682, "pre[t]": 1683, "pre[i]": 1684, "+=": 1685, "pre[i": 1686, "pre[n]": 1687, "check(t)": 1688, "get_prime": 1689, "sizeof(x)": 1690, "*it": 1691, "x[q]": 1692, "get_prime()": 1693, "x[i]": 1694, "instance": 1695, "w=": 1696, "prime[": 1697, "]": 1698, "euql": 1699, "a[sum]": 1700, "prime[k]": 1701, "86": 1702, "steps": 1703, "cnd": 1704, "pre,": 1705, "cnt]": 1706, "prime[i-1]+1": 1707, "pre[i-1]": 1708, "87": 1709, "87,": 1710, "g[": 1711, "rounded": 1712, "v[i": 1713, "check(v[i]": 1714, "book": 1715, "is_p": 1716, "is_p[i]": 1717, "is_p[0]": 1718, "is_p[1]": 1719, "is_p[j]": 1720, "p[i+1]+1": 1721, "is_p[p[i]": 1722, "book[p[i]": 1723, "book[i]": 1724, "(power((x": 1725, "m))": 1726, "power((x": 1727, "n+1,true": 1728, "is_prime[0]": 1729, "is_prime[1]": 1730, "is_prime[i]": 1731, "is_prime[j]": 1732, "prime[j+1]": 1733, "calculateprimes": 1734, "&primes": 1735, "limit": 1736, "calculateprimes(primes,": 1737, "limit)": 1738, "sums": 1739, "primes,": 1740, "sums[i]": 1741, "limit,": 1742, "primes.size()": 1743, "test,": 1744, "primes.size(),": 1745, "sums.push_back(primes[i]": 1746, "sums.size()": 1747, "find(primes.begin(),": 1748, "primes.end(),": 1749, "sums[i])": 1750, "1e18": 1751, "is(i)": 1752, "vec[i": 1753, "is(vec[i]": 1754, "x=int": 1755, "y=x/2": 1756, "z=0": 1757, "x-2*y": 1758, "y=0": 1759, "y=1": 1760, "x/2": 1761, "abs": 1762, "cont": 1763, "star": 1764, "display": 1765, "tmp/2": 1766, "(tmp": 1767, "i)": 1768, "dcount,": 1769, "starcount": 1770, "dcount": 1771, "decreasing": 1772, "(2": 1773, "mf": 1774, "(n": 1775, "read(i,": 1776, "max_n": 1777, "show": 1778, "float": 1779, "ceil(n": 1780, "draw": 1781, "202": 1782, "201": 1783, "\"n%2==0||n": 1784, "201\"": 1785, "draw[i][k]": 1786, "diamondcount": 1787, "draw[i][mid": 1788, "draw[i]": 1789, "abs(mid": 1790, "i),": 1791, "(abs(mid": 1792, "i))),": 1793, "c=array": 1794, "110": 1795, "n,l,r=int": 1796, "c[i][j]='*'": 1797, "n/2+1": 1798, "r<=n": 1799, "l>=1": 1800, "c[i][j]='d'": 1801, "r>=l": 1802, "keep": 1803, "it,": 1804, "going": 1805, "further,": 1806, "doubles": 1807, "301": 1808, "\"*\",": 1809, "(p": 1810, "abs(i)": 1811, "abs(j)": 1812, "abs(i": 1813, "abs(j": 1814, "numd": 1815, "numstar": 1816, "kkk": 1817, "pair<int,": 1818, "int>": 1819, "(a.first": 1820, "b.first),": 1821, "(a.second": 1822, "b.second)": 1823, "b.first)": 1824, "inc": 1825, "(pointer": 1826, "k)": 1827, "(abs((n": 1828, "p)": 1829, "iskom": 1830, "k1": 1831, "dem": 1832, "dem)": 1833, "dem,": 1834, "md": 1835, "1000000009": 1836, "2e3": 1837, "33": 1838, "2))": 1839, "n=int": 1840, "s=array": 1841, "n/2": 1842, "n/2-i": 1843, "s[i][j]='d'": 1844, "s[i][j]='*'": 1845, "j=n/2+1": 1846, "s[i][n-j-1]": 1847, "i=n/2+1": 1848, "s[n-i-1][j]": 1849, "sized": 1850, "matrix": 1851, "arr[i][k]": 1852, "/2": 1853, "n/2-1": 1854, "write": 1855, "star,": 1856, "1000x1000": 1857, "a[k][j]": 1858, "a[n/2][i]": 1859, "forij": 1860, "(1": 1861, "n)": 1862, "key": 1863, "modpow": 1864, "x,n,m,": 1865, "long)": 1866, "u=modpow(x,n/2,m)": 1867, "u=(u*u)": 1868, "u=(u*x)": 1869, "n,k=int,": 1870, "tt=0": 1871, "e=0": 1872, "p=0": 1873, "(n-k)/2": 1874, "tt=1": 1875, "n,count": 1876, "minus": 1877, "(mid": 1878, "cnt)": 1879, "table": 1880, "[maxn][maxn]": 1881, "half": 1882, "table[i][j]": 1883, "exlclusive": 1884, "(half": 1885, "i)),": 1886, "table[half][i]": 1887, "table[u][j]": 1888, "1))": 1889, "102": 1890, "a[n": 1891, "1][j]": 1892, "(size": 1893, "nothing)": 1894, "abs(i-n/2)+abs(j-n/2)": 1895, "a(n)": 1896, "printdiamond": 1897, "diamond": 1898, "dotnum": 1899, "diamond)": 1900, "x[a][n": 1901, "b]": 1902, "x[i][j]": 1903, "(n/2": 1904, "plus": 1905, "print(i,": 1906, "a[i][p": 1907, "a[i][k]": 1908, "between": 1909, "m-i": 1910, "m+i": 1911, "abort": 1912, "program": 1913, "endl": 1914, "sz,": 1915, "s3,": 1916, "s4,": 1917, "s5,": 1918, "s6": 1919, "10,": 1920, "ar2": 1921, "brainfuck": 1922, "=int": 1923, "(n-i*2-1)/2,": 1924, "i*2+1,": 1925, "(n-i2*2-1)/2,": 1926, "i2*2+1,": 1927, "icrement": 1928, "stars": 1929, "ds": 1930, "mp": 1931, "q[i][f]": 1932, "\"\",": 1933, "a[mid]": 1934, "mid,": 1935, "mid),": 1936, "(n-(2*i+1))/2": 1937, "x=0": 1938, "2*i+1": 1939, "o=0": 1940, "i=n-2-1": 1941, "(k": 1942, "(abs(m": 1943, "v)": 1944, "(m": 1945, "i+2": 1946, "n-i/2": 1947, "n-i/2,": 1948, "i=n-2": 1949, "n+i/2": 1950, "t)": 1951, "\\n": 1952, "i,j,n": 1953, "2.0)": 1954, "accepts": 1955, "modpow(x,": 1956, "(u": 1957, "u)": 1958, "x-i": 1959, "x+i": 1960, "od": 1961, "boost": 1962, "times,": 1963, "vector[k]": 1964, "vector[m]": 1965, "star_count": 1966, "d_count": 1967, "integer,": 1968, "back": 1969, "looping": 1970, "nprint": 1971, "0x3f3f3f3f": 1972, "n),": 1973, "nd": 1974, "ns": 1975, "nd)": 1976, "out": 1977, "arr[i": 1978, "arr[i][j": 1979, "out[i][j]": 1980, "t3": 1981, "b[i][j]": 1982, "b[0][0]": 1983, "(b[0][0]": 1984, "b[0][1]": 1985, "(b[0][1]": 1986, "b[1][0]": 1987, "(b[1][0]": 1988, "b[0][2]": 1989, "(b[0][2]": 1990, "b[1][1]": 1991, "(b[1][1]": 1992, "b[1][2]": 1993, "(b[1][2]": 1994, "b[2][0]": 1995, "(b[2][0]": 1996, "b[2][1]": 1997, "(b[2][1]": 1998, "b[2][2]": 1999, "(b[2][2]": 2000, "l[i][j]": 2001, "l[i-1][j]": 2002, "l[i+1][j]": 2003, "l[i][j-1]": 2004, "l[i][j+1]": 2005, "arr2": 2006, "{{1,": 2007, "1},": 2008, "1}}": 2009, "colom": 2010, "arr[row][colom]": 2011, "arr2[row][colom]": 2012, "arr2[row][colom": 2013, "arr2[row": 2014, "1][colom]": 2015, "b[i": 2016, "b[i][j": 2017, "toggle": 2018, "number,": 2019, "a[i][j]=1": 2020, "input=array": 2021, "input[i][j]": 2022, "input[i][j]=input[i][j]": 2023, "toggle(a[i][j])": 2024, "a[i][j+1]": 2025, "toggle(a[i][j+1])": 2026, "a[i+1][j]": 2027, "toggle(a[i+1][j])": 2028, "a[i][j-1]": 2029, "toggle(a[i][j-1])": 2030, "a[i-1][j]": 2031, "toggle(a[i-1][j])": 2032, "containing": 2033, "(int": 2034, "*)a": 2035, "sizeof(int)": 2036, "abs(1": 2037, "a[i][j])": 2038, "a[i][abs(j": 2039, "1)]": 2040, "1)])": 2041, "a[abs(i": 2042, "1)][j]": 2043, "1)][j])": 2044, "1)][(j)])": 2045, "a[0][1]": 2046, "a[2][1]": 2047, "a[1][0]": 2048, "a[1][2]": 2049, "a[x]": 2050, "v[i][j]": 2051, "n[i][j]": 2052, "n[i+1][j]": 2053, "n[i-1][j]": 2054, "n[i][j+1]": 2055, "n[i][j-1]": 2056, "arr,": 2057, "l[i": 2058, "l[i][j": 2059, "2e5": 2060, "[5][5]": 2061, "off_or_on": 2062, "a[i": 2063, "a[i][j": 2064, "bin": 2065, "in[i]": 2066, "bin[i]": 2067, "!bin[i]": 2068, "bin[i": 2069, "9,": 2070, "3]": 2071, "two": 2072, "dimensional": 2073, "sizes": 2074, "light": 2075, "light[i][j]": 2076, "n_i": 2077, "r[k]": 2078, "n_j": 2079, "c[k]": 2080, "light[n_i][n_j]": 2081, "{0},": 2082, "[4][4]": 2083, "a[t][k]": 2084, "b[t][k]": 2085, "a[t][k": 2086, "a[t": 2087, "1][k]": 2088, "dimensions": 2089, "c[i": 2090, "c[i][j": 2091, "pole": 2092, "naj": 2093, "pole[i][j]": 2094, "iii": 2095, "pole[i][iii]": 2096, "pole[i][ii]": 2097, "pole[i+1][ii]": 2098, "pole[i-1][ii]": 2099, "pole[i][ii+1]": 2100, "pole[i][ii-1]": 2101, "isvalid": 2102, "((r": 2103, "3))": 2104, "[j]": 2105, "isvalid(i": 2106, "s[i": 2107, "isvalid(i,": 2108, "s[i][j": 2109, "curr": 2110, "actions": 2111, "actions[i][j]": 2112, "curr[i][j]": 2113, "curr[i][j": 2114, "curr[i": 2115, "a,b": 2116, "b[i][j],": 2117, "b[i-1][j]": 2118, "b[i-1][j],": 2119, "b[i+1][j]": 2120, "b[i][j-1]": 2121, "b[i][j-1],": 2122, "b[i][j+1]": 2123, "a[k][l]": 2124, "arr[5][5]": 2125, "cpy": 2126, "cpy[5][5]": 2127, "cpy[i][j]": 2128, "cpy[i": 2129, "cpy[i][j": 2130, "[]": 2131, "lights": 2132, "lights[i][j]": 2133, "toggle[i][j]": 2134, "lights,": 2135, "f[i][e]": 2136, "p[i][e]": 2137, "f[i][e": 2138, "f[i": 2139, "1][e]": 2140, "[3][3]": 2141, "b[0][0],": 2142, "b[0][1],": 2143, "b[1][0],": 2144, "b[1][1],": 2145, "b[2][0],": 2146, "b[2][1],": 2147, "light,": 2148, "(light[i][j]": 2149, "dx[k]": 2150, "dy[k]": 2151, "light[y][x]": 2152, "(light[y][x]": 2153, "off": 2154, "off[i][j]": 2155, "off[i": 2156, "off[i][j": 2157, "b[i][increment": 2158, "b[i][decrement": 2159, "b[increment": 2160, "i][j]": 2161, "b[decrement": 2162, "j1,": 2163, "press,": 2164, "press": 2165, "[3][3],": 2166, "press[i][j]": 2167, "light[i][j": 2168, "light[i": 2169, "1][j": 2170, "2][j": 2171, "ans[i][j]": 2172, "fill(&ans[0][0],": 2173, "&ans[0][0]": 2174, "sizeof(ans),": 2175, "change(i,": 2176, "change(i": 2177, "[5][5],": 2178, "ar1": 2179, "contents": 2180, "ar[i][j": 2181, "ar[i": 2182, "ar1[i][j]": 2183, "arr[0][0]": 2184, "arr[0][1]": 2185, "arr[1][0]": 2186, "arr1[0][0]": 2187, "arr[1][1]": 2188, "arr[0][2]": 2189, "arr1[0][1]": 2190, "arr[1][2]": 2191, "arr1[0][2]": 2192, "arr[2][0]": 2193, "arr1[1][0]": 2194, "arr[2][1]": 2195, "arr1[1][1]": 2196, "arr[2][2]": 2197, "arr1[1][2]": 2198, "arr1[2][0]": 2199, "arr1[2][1]": 2200, "arr1[2][2]": 2201, "\"1\"": 2202, "\"0\"": 2203, "width": 2204, "a[0][i]": 2205, "a[4][i]": 2206, "a[i][4]": 2207, "(a[i": 2208, "\"11111\"": 2209, "jj": 2210, "arr[ii][j]": 2211, "arr[i][jj]": 2212, "remove": 2213, "arr[i]": 2214, "imprimir": 2215, "mat[i][e]": 2216, "encender": 2217, "mat[i][e": 2218, "mat[i": 2219, "aux": 2220, "toog": 2221, "toog[i][j]": 2222, "_i": 2223, "ni": 2224, "_i[c]": 2225, "nj=": 2226, "_j[c]": 2227, "(ni": 2228, "(nj": 2229, "nj": 2230, "0),": 2231, "mat[ni][nj]": 2232, "!=0,": 2233, "*a": 2234, "*a=0": 2235, "*a=1": 2236, "toggle(&b[i][j])": 2237, "toggle(&b[i][j": 2238, "1])": 2239, "toggle(&b[i": 2240, "1][j])": 2241, "isval": 2242, "(ans[i][j]": 2243, "mat[i][j])": 2244, "isval(x,": 2245, "(ans[x][y]": 2246, "ans[x][y]": 2247, "(a[0][0]": 2248, "a[1][0])": 2249, "a[1][1]": 2250, "a[0][2])": 2251, "(a[0][2]": 2252, "a[1][2])": 2253, "\"0\\n\"": 2254, "\"1\\n\"": 2255, "a[2][0]": 2256, "a[1][1])": 2257, "(a[1][0]": 2258, "a[2][1])": 2259, "a[2][2]": 2260, "(a[2][0]": 2261, "(a[2][2]": 2262, "grid": 2263, "grid[i][j]": 2264, "ans[i][j": 2265, "ans[i": 2266, "ar=array": 2267, "ar[i][j]=1": 2268, "x=long": 2269, "ar[i][j]=1-ar[i][j]": 2270, "ar[i-1][j]=1-ar[i-1][j]": 2271, "ar[i+1][j]=1-ar[i+1][j]": 2272, "ar[i][j+1]=1-ar[i][j+1]": 2273, "ar[i][j-1]=1-ar[i][j-1]": 2274, "size[3][3]": 2275, "p[a][b]": 2276, "res[i][j]": 2277, "(a[i][j]": 2278, "(a[i][j": 2279, "!a[i][j]": 2280, "j+1": 2281, "modd": 2282, "-1ll": 2283, "dir": 2284, "-1},": 2285, "0},": 2286, "{-1,": 2287, "dir[ii][0]": 2288, "dir[ii][1]": 2289, "arr=array": 2290, "arr[0][0]=fabs(arr[0][0]-1)": 2291, "arr[0][1]=fabs(arr[0][1]-1)": 2292, "arr[1][0]=fabs(arr[1][0]-1)": 2293, "arr[0][2]=fabs(arr[0][2]-1)": 2294, "arr[1][2]=fabs(arr[1][2]-1)": 2295, "arr[1][1]=fabs(arr[1][1]-1)": 2296, "arr[2][0]=fabs(arr[2][0]-1)": 2297, "arr[2][2]=fabs(arr[2][2]-1)": 2298, "arr[2][1]=fabs(arr[2][1]-1)": 2299, "!a[i": 2300, "!a[i][j": 2301, "dimension": 2302, "out[0]": 2303, "a[0]+a[1]+a[3]": 2304, "out[1]": 2305, "a[1]+a[0]+a[2]+a[4]": 2306, "out[2": 2307, "a[1]+a[2]+a[5]": 2308, "out[3]": 2309, "a[0]+a[3]+a[4]+a[6]": 2310, "out[4]": 2311, "a[1]+a[3]+a[4]+a[5]+a[7]": 2312, "out[5]": 2313, "a[2]+a[4]+a[5]+a[8]": 2314, "out[6]": 2315, "a[3]+a[6]+a[7]": 2316, "out[7]": 2317, "a[4]+a[6]+a[7]+a[8]": 2318, "out[8]": 2319, "a[7]+a[8]+a[5]": 2320, "out[i]": 2321, "5x5": 2322, "grid[i][j],": 2323, "ans[i][j+1]": 2324, "ans[i][j-1]": 2325, "ans[i-1][j]": 2326, "ans[i+1][j]": 2327, "x[i][0]": 2328, "(x[i][0]": 2329, "x[i][2]": 2330, "(x[i][2]": 2331, "x[i][1]": 2332, "(x[i][1]": 2333, "x[0][j]": 2334, "(x[0][j]": 2335, "x[2][j]": 2336, "(x[2][j]": 2337, "x[1][j]": 2338, "(x[1][j]": 2339, "(x[i][j]": 2340, "ara": 2341, "sizeof(ara)": 2342, "ara[w][q]": 2343, "ara[w": 2344, "1][q]": 2345, "ara[w][q": 2346, "ara[i][r]": 2347, "b[x][y]": 2348, "(a[x][y]": 2349, "a[x": 2350, "a[x][y": 2351, "arx": 2352, "ary": 2353, "y=j": 2354, "arx[l]": 2355, "ary[l]": 2356, "arr[x][y]": 2357, "checkodd": 2358, "checkodd(a[0][0]": 2359, "checkodd(a[0][1]": 2360, "a[0][0]": 2361, "a[0][2]": 2362, "checkodd(a[1][0]": 2363, "checkodd(a[1][2]": 2364, "checkodd(a[2][0]": 2365, "checkodd(a[2][1]": 2366, "sizeof(b)": 2367, "i,j=int,": 2368, "b=array": 2369, "a[i][j],": 2370, "1-b[i][j]": 2371, "1-b[i][j+1]": 2372, "1-b[i][j-1]": 2373, "1-b[i+1][j]": 2374, "1-b[i-1][j]": 2375, "n[i][1],": 2376, "n[i][2],": 2377, "n[i][3]": 2378, "m[i][1]": 2379, "m[i][2]": 2380, "m[i][3]": 2381, "m[i][j]": 2382, "m[i": 2383, "m[i][1],": 2384, "m[i][2],": 2385, "a[3]": 2386, "a[2]": 2387, "a[4]": 2388, "b[2]": 2389, "a[5]": 2390, "b[3]": 2391, "a[6]": 2392, "b[4]": 2393, "a[7]": 2394, "b[5]": 2395, "a[8]": 2396, "b[6]": 2397, "b[7]": 2398, "b[8]": 2399, "b[3],": 2400, "b[4],": 2401, "b[6],": 2402, "b[7],": 2403, "bitwise-xor": 2404, "out[i][j": 2405, "dy]": 2406, "out[i": 2407, "dx][j]": 2408, "ou[i": 2409, "3x3": 2410, "col,": 2411, "y[row][col]": 2412, "incement": 2413, "y[0][1]": 2414, "y[0][0]": 2415, "y[1][0]": 2416, "x[0][1]": 2417, "y[1][1]": 2418, "y[0][2]": 2419, "x[0][2]": 2420, "y[0][1": 2421, "y[1][2]": 2422, "x[1][0]": 2423, "y[2][0]": 2424, "x[1][1]": 2425, "y[2][1]": 2426, "x[1][2]": 2427, "y[2][2]": 2428, "x[2][0]": 2429, "x[2][1]": 2430, "x[2][2]": 2431, "s,t=string": 2432, "n,m,sum,x,y,k,ans,val,l,a=long": 2433, "c=char": 2434, "sum=a[i][j]+a[i-1][j]+a[i+1][j]+a[i][j-1]+a[i][j+1]": 2435, "pdd": 2436, "ans=array": 2437, "ans[i][j]=1": 2438, "sum=input[i][j]": 2439, "i-1": 2440, "input[i-1][j]": 2441, "input[i+1][j]": 2442, "j-1": 2443, "input[i][j-1]": 2444, "input[i][j+1]": 2445, "ans[i][j]=0": 2446, "matrices": 2447, "sizeof(l)": 2448, "!l[i": 2449, "!l[i][j": 2450, "!l[i][j]": 2451, "str[0]": 2452, "\"+------------------------+\"": 2453, "str[1]": 2454, "\"|#.#.#.#.#.#.#.#.#.#.#.|d|)\"": 2455, "str[2]": 2456, "\"|#.#.#.#.#.#.#.#.#.#.#.|.|\"": 2457, "str[3]": 2458, "\"|#.......................|\"": 2459, "str[4]": 2460, "\"|#.#.#.#.#.#.#.#.#.#.#.|.|)\"": 2461, "str[5]": 2462, "23": 2463, "'o',": 2464, "s[2]": 2465, "s[3]": 2466, "s[4]": 2467, "s[5]": 2468, "21": 2469, "outer": 2470, "inner": 2471, "'o'": 2472, "\"|\"": 2473, "\"o.\"": 2474, "\"#.\"": 2475, "\"...\"": 2476, "(4": 2477, "(3": 2478, "))": 2479, "\"|d|)\\n\"": 2480, "\"|.|)\\n\"": 2481, "\"..|\\n\"": 2482, "\"|.|\\n\"": 2483, "copy": 2484, "xx[0]": 2485, "zz": 2486, "xx[1]": 2487, "xx[2]": 2488, "kk": 2489, "xx[3]": 2490, "ss": 2491, "xx[4]": 2492, "xx[5]": 2493, "xx[j][i]": 2494, "xx[i]": 2495, "numbers": 2496, "12": 2497, "numbers[0][0]": 2498, "numbers[1][0]": 2499, "numbers[3][0]": 2500, "numbers[2][0]": 2501, "5)": 2502, "numbers[i][j]": 2503, "+------------------------+": 2504, "|": 2505, "numbers[0][i]": 2506, "|d|)": 2507, "numbers[1][i]": 2508, "|.|": 2509, ".......................|": 2510, "numbers[2][i]": 2511, "single": 2512, "9999999999999": 2513, "a,db": 2514, "'|'": 2515, "\"|d|)\"": 2516, "\"|.|\"": 2517, "\"|o.......................|\"": 2518, "\"|.|)\"": 2519, "\"#.#.#.#.#.#.#.#.#.#.|d|)\"": 2520, "\"#.#.#.#.#.#.#.#.#.#.|.|\"": 2521, "k1,": 2522, "k2,": 2523, "k3,": 2524, "ost": 2525, "k2": 2526, "k3": 2527, "|o.......................|": 2528, "|#.......................|": 2529, "ind": 2530, ".|d|": 2531, ".|.|": 2532, ".|.|)": 2533, "24": 2534, "followin": 2535, "o.": 2536, "#.": 2537, "..": 2538, "|d|": 2539, "..|": 2540, "bus": 2541, "bus[0]": 2542, "bus[1]": 2543, "bus[2]": 2544, "bus[3]": 2545, "bus[4]": 2546, "bus[5]": 2547, "bus[j][i]": 2548, "bus[i]": 2549, "1st": 2550, "2nd": 2551, "|#.#.#.#.#.#.#.#.#.#.#.|d|)": 2552, "3rd": 2553, "|#.#.#.#.#.#.#.#.#.#.#.|.|": 2554, "4th": 2555, "5th": 2556, "|#.#.#.#.#.#.#.#.#.#.#.|.|)": 2557, "6th": 2558, "27": 2559, "exclusive)": 2560, "(st[j][i]": 2561, "st[j][i]": 2562, "ith": 2563, "22": 2564, "[i]": 2565, "\"+------------------------+\\n\"": 2566, "\"..\"": 2567, "|o.#.#.#.#.#.#.#.#.#.#.|d|)": 2568, "|o.#.#.#.#.#.#.#.#.#.#.|.|": 2569, "|o.#.#.#.#.#.#.#.#.#.#.|.|)": 2570, "|o.o.#.#.#.#.#.#.#.#.#.|d|)": 2571, "|o.o.#.#.#.#.#.#.#.#.#.|.|": 2572, "|o.o.#.#.#.#.#.#.#.#.#.|.|)": 2573, "|o.o.o.#.#.#.#.#.#.#.#.|d|)": 2574, "|o.o.o.#.#.#.#.#.#.#.#.|.|": 2575, "|o.o.o.#.#.#.#.#.#.#.#.|.|)": 2576, "|o.o.o.o.#.#.#.#.#.#.#.|d|)": 2577, "|o.o.o.o.#.#.#.#.#.#.#.|.|": 2578, "13": 2579, "|o.o.o.o.#.#.#.#.#.#.#.|.|)": 2580, "14": 2581, "|o.o.o.o.o.#.#.#.#.#.#.|d|)": 2582, "15": 2583, "|o.o.o.o.o.#.#.#.#.#.#.|.|": 2584, "16": 2585, "|o.o.o.o.o.#.#.#.#.#.#.|.|)": 2586, "17": 2587, "|o.o.o.o.o.o.#.#.#.#.#.|d|)": 2588, "18": 2589, "|o.o.o.o.o.o.#.#.#.#.#.|.|": 2590, "19": 2591, "|o.o.o.o.o.o.#.#.#.#.#.|.|)": 2592, "|o.o.o.o.o.o.o.#.#.#.#.|d|)": 2593, "|o.o.o.o.o.o.o.#.#.#.#.|.|": 2594, "|o.o.o.o.o.o.o.#.#.#.#.|.|)": 2595, "|o.o.o.o.o.o.o.o.#.#.#.|d|)": 2596, "|o.o.o.o.o.o.o.o.#.#.#.|.|": 2597, "25": 2598, "|o.o.o.o.o.o.o.o.#.#.#.|.|)": 2599, "26": 2600, "|o.o.o.o.o.o.o.o.o.#.#.|d|)": 2601, "|o.o.o.o.o.o.o.o.o.#.#.|.|": 2602, "28": 2603, "|o.o.o.o.o.o.o.o.o.#.#.|.|)": 2604, "29": 2605, "|o.o.o.o.o.o.o.o.o.o.#.|d|)": 2606, "|o.o.o.o.o.o.o.o.o.o.#.|.|": 2607, "31": 2608, "|o.o.o.o.o.o.o.o.o.o.#.|.|)": 2609, "32": 2610, "|o.o.o.o.o.o.o.o.o.o.o.|d|)": 2611, "|o.o.o.o.o.o.o.o.o.o.o.|.|": 2612, "34": 2613, "|o.o.o.o.o.o.o.o.o.o.o.|.|)": 2614, "arc": 2615, "cosine": 2616, "(-1.0)": 2617, "4)": 2618, "((k": 2619, "else,": 2620, "11th": 2621, "(ind": 2622, "10)": 2623, "(integer": 2624, "(flg": 2625, "2),": 2626, "proceed": 2627, "(ind)th": 2628, "infinite": 2629, "\"o\"": 2630, "\".......................|\"": 2631, "idx": 2632, "s[i][idx]": 2633, "4x11": 2634, "second": 2635, "move": 2636, "|.|)": 2637, "passengers": 2638, "\"..|\"": 2639, "\"ttttttttttttttttttttttttttt\"": 2640, "'+'": 2641, "a[0][25]": 2642, "a[5][0]": 2643, "a[5][25]": 2644, "a[1][26]": 2645, "a[4][26]": 2646, "a[5][i]": 2647, "a[1][i]": 2648, "a[2][i]": 2649, "24,": 2650, "a[3][i]": 2651, "a[i][25]": 2652, "a[i][23]": 2653, "fo": 2654, "ri": 2655, "'t'": 2656, "che": 2657, "\"+----------------------+\"": 2658, "che[0]": 2659, "che[1]": 2660, "che[2]": 2661, "che[3]": 2662, "che[4]": 2663, "\"+----------------------+\")": 2664, "che[5]": 2665, "che[j][i]": 2666, "che[i]": 2667, "\"|o.#.#.#.#.#.#.#.#.#.#.|d|)\"": 2668, "\"|o.#.#.#.#.#.#.#.#.#.#.|.|\"": 2669, "\"|o.#.#.#.#.#.#.#.#.#.#.|.|)\"": 2670, "\"|o.o.#.#.#.#.#.#.#.#.#.|d|)\"": 2671, "\"|o.o.#.#.#.#.#.#.#.#.#.|.|\"": 2672, "\"|o.o.#.#.#.#.#.#.#.#.#.|.|)\"": 2673, "\"|o.o.o.#.#.#.#.#.#.#.#.|d|)\"": 2674, "\"|o.o.o.#.#.#.#.#.#.#.#.|.|\"": 2675, "\"|o.o.o.#.#.#.#.#.#.#.#.|.|)\"": 2676, "\"|o.o.o.o.#.#.#.#.#.#.#.|d|)\"": 2677, "\"|o.o.o.o.#.#.#.#.#.#.#.|.|\"": 2678, "\"|o.o.o.o.#.#.#.#.#.#.#.|.|)\"": 2679, "\"|o.o.o.o.o.#.#.#.#.#.#.|d|)\"": 2680, "\"|o.o.o.o.o.#.#.#.#.#.#.|.|\"": 2681, "\"|o.o.o.o.o.#.#.#.#.#.#.|.|)\"": 2682, "\"|o.o.o.o.o.o.#.#.#.#.#.|d|)\"": 2683, "\"|o.o.o.o.o.o.#.#.#.#.#.|.|\"": 2684, "\"|o.o.o.o.o.o.#.#.#.#.#.|.|)\"": 2685, "\"|o.o.o.o.o.o.o.#.#.#.#.|d|)\"": 2686, "\"|o.o.o.o.o.o.o.#.#.#.#.|.|\"": 2687, "\"|o.o.o.o.o.o.o.#.#.#.#.|.|)\"": 2688, "\"|o.o.o.o.o.o.o.o.#.#.#.|d|)\"": 2689, "\"|o.o.o.o.o.o.o.o.#.#.#.|.|\"": 2690, "\"|o.o.o.o.o.o.o.o.#.#.#.|.|)\"": 2691, "\"|o.o.o.o.o.o.o.o.o.#.#.|d|)\"": 2692, "\"|o.o.o.o.o.o.o.o.o.#.#.|.|\"": 2693, "\"|o.o.o.o.o.o.o.o.o.#.#.|.|)\"": 2694, "\"|o.o.o.o.o.o.o.o.o.o.#.|d|)\"": 2695, "\"|o.o.o.o.o.o.o.o.o.o.#.|.|\"": 2696, "\"|o.o.o.o.o.o.o.o.o.o.#.|.|)\"": 2697, "\"|o.o.o.o.o.o.o.o.o.o.o.|d|)\"": 2698, "\"|o.o.o.o.o.o.o.o.o.o.o.|.|\"": 2699, "\"|o.o.o.o.o.o.o.o.o.o.o.|.|)\"": 2700, "solve()": 2701, "acos(-1.0)": 2702, "\".......................|\\n\"": 2703, "n,t": 2704, "sandali": 2705, "0th": 2706, "(reading": 2707, "(sandali[j][i]": 2708, "jth": 2709, "6)": 2710, "sandali[t]": 2711, "s[6]": 2712, "+------------------------+\"": 2713, "'#',": 2714, "a=1": 2715, "3*": 2716, "+2": 2717, "......................|": 2718, "3*a+4": 2719, "calc_subtractions_slow": 2720, "inlined": 2721, "numops": 2722, "calc_subtractions_div": 2723, "temp)": 2724, "calc_subtractions_mod": 2725, "calc_subtractions": 2726, "calc_subtractions_div(a,": 2727, "subtractions_solve": 2728, "numpairs,": 2729, "numpairs": 2730, "subtractions_solve(cin,": 2731, "cout)": 2732, "a,b=int": 2733, "ans=0": 2734, "a>0": 2735, "b>0": 2736, "a>b": 2737, "a/b": 2738, "a=a": 2739, "b/a": 2740, "b=b": 2741, "swap": 2742, "hasil": 2743, "ret": 2744, "tc": 2745, "cnt=0": 2746, "max=max(a,b)": 2747, "min=min(a,b)": 2748, "max>0": 2749, "min>0": 2750, "max/min": 2751, "temp=min": 2752, "min=max-min*(max/min)": 2753, "max=temp": 2754, "min(a,": 2755, "max(a,": 2756, "unsigned": 2757, "swp": 2758, "addresses": 2759, "test_div": 2760, "int_max": 2761, "1000000000,": 2762, "999999999": 2763, "test_mod": 2764, "getnumbers": 2765, "gotvalue": 2766, "gotvale": 2767, "subtractions_solve_low": 2768, "istream": 2769, "in,": 2770, "ostream": 2771, "subtractions_solve_fast": 2772, "getline": 2773, "nums": 2774, "nums[0],": 2775, "nums[1]": 2776, "cin,": 2777, "cout": 2778, "round": 2779, "1.0": 2780, "a[1000]": 2781, ">y": 2782, "x/y": 2783, "y/x": 2784, "=y": 2785, "(d": 2786, "cntint": 2787, "cntfloat": 2788, "adivb,": 2789, "bdiva,": 2790, "adivb": 2791, "bdiva": 2792, "total": 2793, "positive": 2794, "a/b*b": 2795, "b/a*a": 2796, "ans(0)": 2797, "doit": 2798, "t--": 2799, "doit(a,": 2800, "(1ll": 2801, "31)": 2802, "get(a,b)": 2803, "we": 2804, "valid": 2805, "orderarguments": 2806, "arg1,": 2807, "arg2": 2808, "arg1": 2809, "subtraction": 2810, "areg2": 2811, "\"arg1=\"": 2812, "\"arg2=\"": 2813, "quotient": 2814, "evaluate": 2815, "numoftestcases": 2816, "casos,": 2817, "casos": 2818, "((a": 2819, "(o": 2820, "((b": 2821, "modu": 2822, "(n,": 2823, "\"1\",": 2824, "cases": 2825, "num1,": 2826, "num2": 2827, "ops": 2828, "num1": 2829, "gcd": 2830, "gcd(b,": 2831, "solve(b": 2832, "a))": 2833, "solve(min(a,": 2834, "b),": 2835, "b))": 2836, "getans": 2837, "getans(b": 2838, "getans(min(a,": 2839, "decreased": 2840, "n--": 2841, "10000002": 2842, "1000001": 2843, "cift": 2844, "tek": 2845, "t_ab": 2846, "t_a": 2847, "t_b": 2848, "calling": 2849, "bigger": 2850, "lower": 2851, "ctr,": 2852, "rad": 2853, "first,": 2854, "second,": 2855, "smaller,": 2856, "larger": 2857, "mult": 2858, "smaller": 2859, "infinitely": 2860, "f(x,": 2861, "a>b,": 2862, "a=b": 2863, "a=0": 2864, "b=": 2865, "gcd_answ": 2866, "(a,": 2867, "gcd_answ(a,": 2868, "initialize": 2869, "settings": 2870, "1073741824": 2871, "f(b": 2872, "f(a,b)": 2873, "max1": 2874, "3e8": 2875, "acos(-1)": 2876, "a,b=long": 2877, "x=max(a,b),": 2878, "y=min(a,b),": 2879, "x>0": 2880, "y>0": 2881, "(x/y)*y": 2882, "m=max(x,y),": 2883, "n=min(x,y)": 2884, "x=m": 2885, "y=n": 2886, "calc": 2887, "0ll": 2888, "calc(b,": 2889, "calc(a,b)": 2890, "tc=int": 2891, "res=0": 2892, "swap(a,b)": 2893, "h=b-a": 2894, "a-h": 2895, "h/a": 2896, "subtraction(a,b),": 2897, "co,": 2898, "co": 2899, "(co": 2900, "shift": 2901, "places": 2902, "numoftestcases,": 2903, "subtraction(r,": 2904, "w)": 2905, "longs,": 2906, "f(n,m)": 2907, "int64_t": 2908, "modex": 2909, "(res": 2910, ">>=": 2911, "dv": 2912, "count((min": 2913, "(max": 2914, "count(min(a,": 2915, "n,a,b,r,c=long": 2916, "r=0": 2917, "x=a": 2918, "b=x": 2919, "c=b/a": 2920, "b=b-a*c": 2921, "iterations": 2922, "noop": 2923, "solve(a,": 2924, "a(0),": 2925, "b(0)": 2926, "total(0)": 2927, "final": 2928, "path": 2929, "txt.in": 2930, "txt.out": 2931, "fixed": 2932, "setprecision": 2933, "a/b,": 2934, "b/a,": 2935, "kq": 2936, "xuli": 2937, "_": 2938, "lcm": 2939, "retutn": 2940, "100005": 2941, "say": 2942, "cmd": 2943, "people_cnt": 2944, "cmd[0]": 2945, "\":\"": 2946, "(length": 2947, "cmd)": 2948, "maxs": 2949, "100+10": 2950, "s[t]": 2951, "':',": 2952, "unique": 2953, "skipping": 2954, "erase": 2955, "':'": 2956, "q)": 2957, "save": 2958, "position": 2959, "eof": 2960, "1000000": 2961, "total,": 2962, "'+',": 2963, "c[t]": 2964, "((length": 2965, "s)": 2966, "105": 2967, "byte": 2968, "ch[0]": 2969, "active": 2970, "ineger": 2971, "s[9]": 2972, "i(0)": 2973, "commands": 2974, "person,": 2975, "mark_idx,": 2976, "send_size": 2977, "person": 2978, "commands[0]": 2979, "mark_idx": 2980, "unintialized": 2981, "time": 2982, "neither": 2983, "colon": 2984, "followed": 2985, "1e2": 2986, "creatre": 2987, "mygets": 2988, "me,": 2989, "ok,": 2990, "me": 2991, "c[i]": 2992, "characterfrom": 2993, "input,": 2994, "\"+\"": 2995, "\"-\"": 2996, "gets(s1)": 2997, "s1[j]": 2998, "(s1": 2999, "{}": 3000, "c2,": 3001, "c3,": 3002, "c3": 3003, "infinity": 3004, "c3)": 3005, "comando": 3006, "comando[0]": 3007, "ln": 3008, "(ln": 3009, "n_participantes,": 3010, "n_bytes,": 3011, "n_participantes=0,": 3012, "n_bytes=0": 3013, "linha_chat": 3014, "linha_chat[0]": 3015, "n_participantes": 3016, "linha_chat[x]": 3017, "n_bytes": 3018, "st[0]": 3019, "st[i]": 3020, "10005": 3021, "sm": 3022, "mp[st]": 3023, ";": 3024, "(sz": 3025, "s[idx-1]": 3026, "s[idx": 3027, "((int)s.size()": 3028, "idx)": 3029, "local": 3030, "s[i],": 3031, "vis": 3032, "205": 3033, "(s": 3034, "local(s)": 3035, "tp(s,": 3036, "st)": 3037, "vis.count(tp)": 3038, "strlen(s": 3039, "vis.size()": 3040, "(len": 3041, "cine": 3042, "result,": 3043, "z)": 3044, "empty,": 3045, "command": 3046, "command[0]": 3047, "id": 3048, "command[i]": 3049, "clear": 3050, "command.substr(1,": 3051, "command.size()": 3052, "id)": 3053, "lens": 3054, "(lens": 3055, "frq": 3056, "count1": 3057, "count1,": 3058, "store": 3059, "count;": 3060, "users": 3061, "traffic": 3062, "olnum": 3063, "charnum,": 3064, "charsum": 3065, "charnum": 3066, "indefinitely": 3067, "input[0]": 3068, "inpu[0]": 3069, "coun": 3070, "count_now": 3071, "input[i]": 3072, "findlen": 3073, "ss[i]": 3074, "ss[0]": 3075, "findlen(ss)": 3076, "it's": 3077, "check1": 3078, "check1(s)": 3079, "findlen(string": 3080, "ss)": 3081, "getline(cin,": 3082, "+(": 3083, "lengh": 3084, "txt,": 3085, "txt": 3086, "txt[0]": 3087, "txt[i]": 3088, 